class Question {
  final String questionText;
  final List<Answer> answersList;

  Question(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final int score;

  Answer(this.answerText, this.score);
}

List<Question> getQuestions() {
  List<Question> list = [];

  list.add(Question(
    "انه يفضل القيام بالاشياء مع الاخرين بدلا من التركيز على القيام بها بمفرده ",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));

  list.add(Question(
    "انه يفضل أن يفعل الاشياء بنفس الطريقة مرارا وتكرارا",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));

  list.add(Question(
    " إذا حاول أن يتخيل شيئاً ما، فانه يجد من السهل جدا تخيل صورة له في عقله.",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "لديه صعوبة في فهم قواعد السلوك المهذب",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "انه كثيرا ما مايستغرق بشيئ واحد فقط ولا ينتبه للأشياء الاخرى.",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "انه كثيرا ما يلاحظ الاصوات بسيطة في حين لا يتبه لها الاخرين.",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "انه يميل لمالحظة التفاصيل التي لا يلاحظها الاخرين",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "انه عادة يلاحظ أرقام المنازل أو المعلومات المماثلة",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "يستمتع بالاحاديث والدردشة الاحتماعية",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "عند قراءة قصة ما، فانه بسهولة يستطيع تخيل الشخصيات وكيف تبدو في سياق القصة",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "انه يفضل الذهاب إلى المكتبة بدلا من حضور حفلة عيد ميلاد",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "ينجذب بقوة إلى الاشخاص أكثر من تعلقه بالاشياء",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "لديه اهتمامات محددة وشديدة، وانقطاعها أو ابعاده عنها يجعله ينزعج بشدة إذا لم يتمكن من متابعتها ",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "يجد صعوبة في تكوين صداقات جديدة",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));

  list.add(Question(
    "عندما يقرأ قصة ما، فإنه يجد صعوبة في معرفة نوايا الشخصيات أو مشاعرها",
    [
      Answer("أوافق بشدة", 1),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 3),
      Answer("أعارض بشدة", 4),
    ],
  ));
  list.add(Question(
    " إنه يلاحظ أنماط أو نماذج الاشياء في كل الاوقات",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "انه لا يعرف كيفية الحفاظ على الحوار المتبادل مع أقرانه",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "كثيرا مايقول له الناس أنه يفعل الشيئ نفسه مرارا وتكرارا",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "يسهل عليه معرفة ما يفكر أو يشعر به اآلخرين بمجرد النظر إلى وجوههم",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "انه يجد صعوبة في معرفة واكتشاف نوايا الناس",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "انه جيد في العناية بالاخرين والحرص على عدم إيذاء مشاعر الاخرين",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "يجد من السهل التأقلم مع الاوضاع الاجتماعية.",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "يبدي انزعاجاً عند تغيير الروتين اليومي",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  list.add(Question(
    "انه يستمتع بالقيام باألفعال من تلقاء نفسه",
    [
      Answer("أوافق بشدة", 0),
      Answer("أوافق قليلا", 1),
      Answer("أعارض قليلا ", 2),
      Answer("أعارض بشدة", 3),
    ],
  ));
  list.add(Question(
    "غالبا هو آخر من يفهم فكرة الفكاهة أو المزاح",
    [
      Answer("أوافق بشدة", 3),
      Answer("أوافق قليلا", 2),
      Answer("أعارض قليلا ", 1),
      Answer("أعارض بشدة", 0),
    ],
  ));
  return list;
}
